In [7]:
import numpy as np, pandas as pd
import seaborn as sns
print(sns.__version__)

0.11.2

In [3]:
planets = sns.load_dataset("planets")
print(planets.ndim, "\n",planets.shape,"\n",planets.size)

2
 (1035, 6)
 6210

In [5]:
print(planets.head())
print("\n")
print(planets.tail())

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009


       method  number  orbital_period  mass  distance  year
1030  Transit       1        3.941507   NaN     172.0  2006
1031  Transit       1        2.615864   NaN     148.0  2007
1032  Transit       1        3.191524   NaN     174.0  2007
1033  Transit       1        4.125083   NaN     293.0  2008
1034  Transit       1        4.187757   NaN     260.0  2008

In [9]:
rng = np.random.RandomState(693)
ser = pd.Series(rng.rand(5))
print(ser)

0    0.863563
1    0.730811
2    0.714883
3    0.304535
4    0.303606
dtype: float64

In [10]:
# simple aggregation

print(ser.sum())
print(ser.min())
print(ser.max())
print(ser.median())

2.9173984617754503
0.30360607598818756
0.8635628757912657
0.7148831986138869

In [11]:
df = pd.DataFrame({"A":rng.rand(5),"B":rng.rand(5)})
print(df,"\n")

          A         B
0  0.950046  0.772329
1  0.133934  0.542531
2  0.754870  0.008758
3  0.017715  0.364698
4  0.637019  0.458972

In [12]:
print(df.mean())

A    0.498717
B    0.429458
dtype: float64

In [13]:
print(df.mean(axis="rows")) # create a new row result

A    0.498717
B    0.429458
dtype: float64

In [14]:
print(df.mean(axis="columns")) # create a new column result

0    0.861188
1    0.338232
2    0.381814
3    0.191206
4    0.547995
dtype: float64

In [15]:
# describe()

print(planets.dropna().describe())

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [16]:
# Groupby
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'], 
 'data': range(6)}, columns=['key', 'data']) 

print(df)

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [17]:
df.groupby("key").sum()

     data
key
A       3
B       5
C       7

In [18]:
df.groupby("key").mean()

     data
key
A     1.5
B     2.5
C     3.5

In [19]:
df.groupby("key").max()

     data
key
A       3
B       4
C       5

In [20]:
df.groupby("key").min()

     data
key
A       0
B       1
C       2

In [21]:
print(planets.head())

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [22]:
print(planets.groupby("year")["mass"].mean())

year
1989    11.680000
1992          NaN
1994          NaN
1995     0.472000
1996     1.979400
1997     1.040000
1998     2.687120
1999     3.236643
2000     3.633014
2001     3.430909
2002     3.937290
2003     3.660955
2004     1.454267
2005     2.003897
2006     1.799800
2007     3.702094
2008     3.424339
2009     3.628568
2010     1.289610
2011     1.209084
2012     3.658596
2013     2.203400
2014     1.068000
Name: mass, dtype: float64

In [23]:
print(planets.groupby("year")["distance"].mean())

year
1989     40.570000
1992           NaN
1994           NaN
1995     15.360000
1996     15.866667
1997     17.430000
1998     26.302000
1999     30.947333
2000     30.752500
2001     36.531667
2002     44.396129
2003     43.085417
2004    184.777826
2005     46.484324
2006    660.228929
2007    162.656000
2008     98.680312
2009     82.056747
2010    256.796344
2011    319.015032
2012    563.286154
2013    529.767746
2014    359.836667
Name: distance, dtype: float64

In [24]:
# aggregate, filter, transform, apply

rng = np.random.RandomState(0) 
 
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'], 
 'data1': range(6), 
 'data2': rng.randint(0, 10, 6)}, 
 columns = ['key', 'data1', 'data2'])

print(df)

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [26]:
print(df.groupby("key").aggregate(["min",np.median,"max"]))

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

In [27]:
print(df.groupby("key").aggregate({"data1":"min","data2":"max"}))

     data1  data2
key
A        0      5
B        1      7
C        2      9

In [29]:
 df.groupby('key').transform(lambda god: god - god.mean())

   data1  data2
0   -1.5    1.0
1   -1.5   -3.5
2   -1.5   -3.0
3    1.5   -1.0
4    1.5    3.5
5    1.5    3.0

In [30]:
# Apply method

def norm_by_data2(x):
    # x是一个分组数据的DataFrame 
    x['data1'] /= x['data2'].sum() 
    return x

print(df.groupby("key").apply(norm_by_data2))

  key     data1  data2
0   A  0.000000      5
1   B  0.142857      0
2   C  0.166667      3
3   A  0.375000      3
4   B  0.571429      7
5   C  0.416667      9

In [37]:
# 设置分割的key

print(df)
L = [0,0,0,1,1,1] # len(L) = datafram row numbers
print("\n------------------------------------------\n")
print(df.groupby(L).sum())

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

------------------------------------------

   data1  data2
0      3      8
1     12     19

In [38]:
# mapping

df2 = df.set_index('key') 

mapping = {'A': 'Tom', 'B': 'Tom', 'C': 'Jerry'}
df2.groupby(mapping).sum()

       data1  data2
key
Jerry      7     12
Tom        8     15